### Assignment for Data QA & QC Internship @ Datahut

In [626]:
# Import Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

import re

In [627]:
# Load the dataset
mdf= pd.read_csv(r"C:\Users\Abiya\Desktop\Internship\messy_data.csv")

# Display first few rows
mdf.head(16)

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
0,0,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,NaN,88552.000000,Sales
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.000000,NaN
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.000000,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.000000,SupportJ
4,4,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,NaN,143456.000000,Marketing
5,5,f92ea13f-24d3-4792-91e4-5b0e07d90c2c,Lisa Bailey,81.0,milleryvonne@fowler-york.com,15/10/2016,123018.000000,SupportE
6,6,c4892dbb-2554-4ce1-8f11-f6597d7f6782,Patricia Brown DVM,66.0,pperkinshotmail.com,17/09/2020,77311.000000,HR
7,7,465e625b-f924-4061-8356-c7e3130f7118,Derek Murphy,38.0,josephrobertsongmail.com,2021-01-12,NaN,Support
8,8,12cc2f16-d641-402e-b22b-3332bafc4f1d,NaN,71.0,andrew74@hotmail.com,2022-02-12,83354.000000,Sales
9,9,d06f507d-62e5-4bd6-a252-4e60e109d324,Jay Fisher,44.0,denisemaynard@jordan.com,2022-12-08,37701.725993,HR
10,10,d5fe9321-49cf-4f14-ac96-7aea1204247b,Craig Conway,88.0,gerald47@woodard-smith.com,NaN,81214.525972,Engineering
11,11,21763907-db1a-400a-8464-e3af593c3abc,Raymond Wilson,44.0,katherinewallacehotmail.com,2021-08-26,128335.000000,HRC
12,12,da63d159-e9b0-4b92-b0fe-4e87df3aebc1,Amber Marsh,23.0,robert43@gmail.com,2023-09-08,112970.000000,Engineering
13,13,5ca27087-5c90-4d42-94d0-7e9ee3f422b9,Patrick Mooney,57.0,bowersjasmine@hotmail.com,2023-06-24,41511.139646,SalesA
14,14,9b83a5e5-9516-493f-86f8-d6c445edb501,Nicole Cardenas,60.0,griffinlinda@harrison.com,16/10/2003,51625.814403,Marketing
15,15,0074dbd5-10d0-463f-9b10-d8473bea04ba,NaN,22.0,ericjohnson@castillo-mendez.net,2023-03-01,NaN,HR

In [628]:
# Total rows and columns
mdf.shape

(11000, 8)

##### Data Cleaning

In [629]:
# Check for data types, null values and column names
mdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11000 entries, 0 to 10999
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  11000 non-null  int64
 1   ID          11000 non-null  object
 2   Name        8667 non-null   object
 3   Age         9253 non-null   float64
 4   Email       9731 non-null   object
 5   Join Date   8808 non-null   object
 6   Salary      8761 non-null   float64
 7   Department  8745 non-null   object
dtypes: float64(2), int64(1), object(5)
memory usage: 687.6+ KB

In [630]:
# Summary Statistics
mdf.describe()

         Unnamed: 0          Age         Salary
count  11000.000000  9253.000000    8761.000000
mean    5012.947818    54.162650   89886.585012
std     2884.739158    21.072919   34896.320117
min        0.000000    18.000000   24655.136613
25%     2509.750000    36.000000   59723.844874
50%     5024.500000    54.000000   89241.000000
75%     7510.250000    72.000000  119491.000000
max     9999.000000    90.000000  176156.206747

In [631]:
mdf.duplicated().sum()

np.int64(291)

#### QA Issues:
1) Missing values: Check for columns with nulls.
2) Duplicate entries,Rename Column,Incorrect datatypes.
3) Incorrect email formats.
4) Inconsistent department names.
5) Unreasonable values in 'Age' and 'Salary'.

##### 1. Handling Missing values

In [632]:
# checking null values
mdf.isnull().sum()

Unnamed: 0       0
ID               0
Name          2333
Age           1747
Email         1269
Join Date     2192
Salary        2239
Department    2255
dtype: int64

In [633]:
# Remove rows where the 'Name' column is missing
mdf = mdf.dropna(subset=['Name'])

In [634]:
# Handle missing values in numerical columns by filling with the mean
numeric_columns = mdf.select_dtypes(include=['float64', 'int64']).columns
mdf[numeric_columns] = mdf[numeric_columns].apply(lambda x: x.fillna(x.mean()))

In [635]:
# Handle missing values in categorical columns by filling with the mode
categorical_columns = mdf.select_dtypes(include=['object']).columns
mdf[categorical_columns] = mdf[categorical_columns].apply(lambda x: x.fillna(x.mode()[0]))

mdf.head()

,Unnamed: 0,ID,Name,Age,Email,Join Date,Salary,Department
0,0,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,2022-03-31,88552.0,Sales
1,1,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,Support
2,2,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,3,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
4,4,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,2022-03-31,143456.0,Marketing

In [636]:
mdf.isnull().sum()

Unnamed: 0    0
ID            0
Name          0
Age           0
Email         0
Join Date     0
Salary        0
Department    0
dtype: int64

##### 2. Remove Duplicates

In [637]:
# Drop duplicate rows
mdf = mdf.drop_duplicates()
mdf.duplicated().sum()

np.int64(0)

In [638]:
mdf.shape

(8579, 8)

In [639]:
# Rename the column 'unwanted: 0'
mdf = mdf.rename(columns={'Unnamed: 0': 'SL.No'})
mdf.columns

Index(['SL.No', 'ID', 'Name', 'Age', 'Email', 'Join Date', 'Salary',
       'Department'],
      dtype='object')

In [640]:
# Add Serial Number (starting from 1)
mdf['SL.No'] = range(1, len(mdf) + 1)

mdf.head(5)

,SL.No,ID,Name,Age,Email,Join Date,Salary,Department
0,1,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25.0,xlopez@hotmail.com,2022-03-31,88552.0,Sales
1,2,379f55b8-87d5-4739-a146-7400b78c24d1,Jeremy Irwin,90.0,Jillian Jenkins,2022-07-07,139227.0,Support
2,3,18261368-dfa1-47f0-afc6-bddf45926b07,Jennifer Hammondquickly,66.0,jscottgreen.biz,2023-11-21,65550.0,Engineering
3,4,ae7cf7cf-17cf-4c8b-9c44-4f61a9a238e5,Sydney Taylorso,39.0,luke56gonzalez.com,2021-11-05,139932.0,SupportJ
4,5,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71.0,figueroakayla@yahoo.com,2022-03-31,143456.0,Marketing

In [641]:
# checking for data types
mdf.dtypes

SL.No           int64
ID             object
Name           object
Age           float64
Email          object
Join Date      object
Salary        float64
Department     object
dtype: object

In [642]:
# Convert 'Age' column to nullable integer, handling non-integer values
mdf['Age'] = mdf['Age'].astype('float').round().astype('Int64')

# Convert Salary to integer
mdf['Salary'] = mdf['Salary'].astype('float').round().astype('Int64')

In [643]:
# Convert Join Date to datetime
mdf['Join Date'] = pd.to_datetime(mdf['Join Date'], errors='coerce')  

mdf.dtypes

SL.No                  int64
ID                    object
Name                  object
Age                    Int64
Email                 object
Join Date     datetime64[ns]
Salary                 Int64
Department            object
dtype: object

##### Correction of Email Formats

In [644]:
# Define a pattern for a valid email
email_pattern = r'^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$'

# Create a function to validate email
def validate_email(email):
    if re.match(email_pattern, email):
        return email  # Return email if it's valid
    else:
        return "Invalid"  # Mark as 'Invalid' if it doesn't match the pattern

# Apply the function to the Email column
mdf['Email'] = mdf['Email'].apply(validate_email)

mdf['Email'].head(5)

0         xlopez@hotmail.com
1                    Invalid
2                    Invalid
3                    Invalid
4    figueroakayla@yahoo.com
Name: Email, dtype: object

In [645]:
# Remove rows with invalid emails
mdf = mdf[mdf['Email'] != "Invalid"]

mdf['Email'].head(5)

0               xlopez@hotmail.com
4          figueroakayla@yahoo.com
5     milleryvonne@fowler-york.com
9         denisemaynard@jordan.com
10      gerald47@woodard-smith.com
Name: Email, dtype: object

##### Clean Name Fields:

In [646]:
# Remove any noise from names by trimming and capitalizing them consistently
mdf['Name'] = mdf['Name'].str.replace(r'\d+', '', regex=True).str.strip().str.title()

##### Standardize Date Formats:

In [647]:
# Convert 'Join Date' to a consistent date format
mdf['Join Date'] = pd.to_datetime(mdf['Join Date'], format='%Y-%m-%d', errors='coerce')

# Drop rows where the date format is invalid
mdf = mdf.dropna(subset=['Join Date'])

mdf.head()

,SL.No,ID,Name,Age,Email,Join Date,Salary,Department
0,1,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25,xlopez@hotmail.com,2022-03-31,88552,Sales
4,5,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71,figueroakayla@yahoo.com,2022-03-31,143456,Marketing
9,9,d06f507d-62e5-4bd6-a252-4e60e109d324,Jay Fisher,44,denisemaynard@jordan.com,2022-12-08,37702,HR
10,10,d5fe9321-49cf-4f14-ac96-7aea1204247b,Craig Conway,88,gerald47@woodard-smith.com,2022-03-31,81215,Engineering
12,12,da63d159-e9b0-4b92-b0fe-4e87df3aebc1,Amber Marsh,23,robert43@gmail.com,2023-09-08,112970,Engineering

##### Correct Department Names:

In [648]:
mdf['Department'].unique()

array(['Sales', 'Marketing', 'HR', 'Engineering', 'SalesA', 'MarketingR',
       'Salesw', 'SalesK', 'MarketingU', 'Support', 'EngineeringL', 'HRs',
       'Supportj', 'Salesd', 'SalesZ', 'Engineeringe', 'Marketingr',
       'Engineeringm', 'Saleso', 'SalesW', 'Engineeringp', 'HRv',
       'SalesC', 'SupportC', 'EngineeringK', 'SalesN', 'SupportB', 'HRi',
       'Supportg', 'Supporta', 'HRn', 'Supportm', 'EngineeringH',
       'Marketingw', 'EngineeringM', 'HRr', 'MarketingD', 'HRE', 'HRw',
       'Supportk', 'SupportS', 'EngineeringD', 'Marketingz', 'Salesl',
       'Salesr', 'MarketingO', 'SalesF', 'Salesz', 'Marketingt',
       'Engineeringv', 'HRL', 'HRI', 'Marketingk', 'Engineeringi',
       'Salesn', 'Engineeringl', 'SalesE', 'HRy', 'SalesD', 'HRm', 'HRz',
       'MarketingG', 'Marketingn', 'Engineeringg', 'MarketingE',
       'SupportA', 'Engineeringq', 'EngineeringQ', 'Supporte',
       'Engineeringu', 'EngineeringO', 'Supportv', 'HRK', 'Engineeringb',
       'SalesV', 'HRT', 'SupportY', 'MarketingX', 'MarketingQ', 'Salesy',
       'HRU', 'HRt', 'HRp', 'HRg', 'SalesS', 'HRo', 'Engineeringt',
       'EngineeringX', 'Engineeringc', 'Marketingh', 'MarketingF',
       'EngineeringC', 'HRP', 'Salesv', 'Engineeringk', 'SupportH', 'HRW',
       'Salesk', 'Supporth', 'Supportq', 'Salesi', 'HRZ', 'SupportJ',
       'Marketingl', 'MarketingZ', 'Salesc', 'EngineeringT', 'Salesq',
       'Engineeringh', 'Supportl', 'Supportp', 'SupportQ', 'Marketinge',
       'EngineeringG', 'SalesH', 'SupportV', 'Marketingb', 'Supporti',
       'HRM', 'Supportt', 'EngineeringE', 'SupportP', 'HRf', 'MarketingB',
       'HRJ', 'Engineeringf', 'SalesM', 'HRA', 'Marketingj', 'MarketingV',
       'MarketingN', 'HRl', 'MarketingC', 'Marketingi', 'Supportw',
       'Engineerings', 'Supportb', 'SupportL', 'Marketingf', 'Marketingg',
       'SupportK', 'Engineeringd', 'HRN', 'HRk', 'SalesR', 'MarketingS',
       'MarketingL', 'MarketingT', 'HRR', 'Engineeringw', 'Salesg', 'HRB',
       'Engineeringz', 'EngineeringV', 'HRb', 'SupportN', 'SupportO',
       'SalesX', 'EngineeringZ', 'SupportG', 'Engineeringx', 'Marketingc',
       'EngineeringU', 'MarketingJ', 'Supportx', 'SalesB', 'Salesp',
       'HRX', 'SalesY', 'MarketingK', 'SalesL', 'Marketingq', 'SupportD',
       'Salesu', 'SalesT', 'Supports', 'HRQ', 'Supportr', 'Engineeringr',
       'EngineeringW', 'Saless', 'HRC', 'HRY', 'SupportW', 'EngineeringI',
       'Marketingy', 'MarketingM', 'SupportI', 'EngineeringF', 'HRF',
       'SalesU', 'EngineeringJ', 'Engineeringa', 'SupportU', 'Salesa',
       'Supportn', 'Salesf', 'MarketingY', 'HRd', 'Salest', 'Salesj',
       'HRu', 'Salesh', 'SalesI', 'SupportX', 'HRD', 'SupportE', 'HRj',
       'HRe', 'Supporto', 'MarketingH', 'Marketingx', 'EngineeringN',
       'SupportM', 'HRV', 'HRa', 'Salese', 'HRG', 'SalesP',
       'EngineeringR', 'Marketingv', 'HRx', 'Engineeringn',
       'Engineeringj', 'EngineeringS', 'EngineeringP', 'Engineeringy',
       'SalesO', 'Salesm', 'Marketingd', 'SalesJ', 'SupportF', 'SupportT',
       'Supportc', 'HRq', 'Marketinga', 'Marketings', 'HRh', 'Marketingp',
       'SupportR', 'HRH', 'MarketingW', 'Supporty', 'HRc', 'EngineeringA',
       'Supportf', 'Marketingu', 'SupportZ', 'Marketingm', 'Supportz',
       'Supportu', 'SalesG', 'EngineeringB', 'SalesQ', 'Salesb', 'HRS',
       'Supportd', 'MarketingI', 'Engineeringo', 'HRO'], dtype=object)

In [649]:
unique_department_count = mdf['Department'].nunique()
print(f'Total unique departments: {unique_department_count}')

Total unique departments: 260

In [650]:
# Define a function to standardize department names
def correct_department(dept):
    if 'HR' in dept:
        return 'HR'
    elif 'Engineering' in dept:
        return 'Engineering'
    elif 'Sales' in dept:
        return 'Sales'
    elif 'Support' in dept:
        return 'Support'
    elif 'Marketing' in dept:
        return 'Marketing'
    else:
        return 'Unknown'

# Apply the correction function
mdf['Department'] = mdf['Department'].apply(correct_department)

In [651]:
mdf['Department'].unique()

array(['Sales', 'Marketing', 'HR', 'Engineering', 'Support'], dtype=object)

##### Handle Salary Noise

In [652]:
# Remove salaries outside the reasonable range
salary_data = mdf[(mdf['Salary'] >= 30000) & (mdf['Salary'] <= 200000)]

# Round salary values to whole numbers
salary_data = salary_data.assign(Salary= salary_data['Salary'].round(0).astype(int))

# Identify outliers using IQR
Q1 = salary_data['Salary'].quantile(0.25)
Q3 = salary_data['Salary'].quantile(0.75)
IQR = Q3 - Q1

# Remove outliers
salary_data = salary_data[~((salary_data['Salary'] < (Q1 - 1.5 * IQR)) | (salary_data['Salary'] > (Q3 + 1.5 * IQR)))]

mdf.head()

,SL.No,ID,Name,Age,Email,Join Date,Salary,Department
0,1,1e407ff9-6255-489d-a0de-34135d4f74bd,Hunter Thomas,25,xlopez@hotmail.com,2022-03-31,88552,Sales
4,5,14ed3e6a-e0f5-4bbe-8d93-8665267f5c90,Julia Lee,71,figueroakayla@yahoo.com,2022-03-31,143456,Marketing
9,9,d06f507d-62e5-4bd6-a252-4e60e109d324,Jay Fisher,44,denisemaynard@jordan.com,2022-12-08,37702,HR
10,10,d5fe9321-49cf-4f14-ac96-7aea1204247b,Craig Conway,88,gerald47@woodard-smith.com,2022-03-31,81215,Engineering
12,12,da63d159-e9b0-4b92-b0fe-4e87df3aebc1,Amber Marsh,23,robert43@gmail.com,2023-09-08,112970,Engineering

In [653]:
#cleaned DataFrame
mdf= mdf.to_csv('cleaned_dataset.csv', index=False)

### Data Cleaning Steps Summary

1. **Missing Values**:
   - Removed rows without names.
   - Filled missing numbers with the average and categories with the most common value.

2. **Duplicates**:
   - Dropped duplicate rows and renamed a column for clarity.

3. **Data Types**:
   - Changed 'Age' and 'Salary' to integers and 'Join Date' to a date format.

4. **Email Validation**:
   - Checked and removed emails that were not properly formatted.

5. **Name Cleaning**:
   - Removed numbers and standardized names.

6. **Date Standardization**:
   - Ensured all dates were in the same format.

7. **Department Correction**:
   - Fixed inconsistencies in department names.

8. **Salary Handling**:
   - Removed unreasonable salaries and outliers.

This process ensured the data is clean and ready for analysis.